Core/src/src/Documents/НачислениеНалогов/НачислениеНалогов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеНалогов</name>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыПоНалогам</registerRecords>
  <registerRecords>AccumulationRegister.Запасы</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходы</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСФондамиПоСтраховымВзносам</registerRecords>
  <registerRecords>AccumulationRegister.НДФЛРасчетыНалоговыхАгентовСБюджетом</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийНачислениеНалогов</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyПроекты</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Налоги</name>
    <attributes>
      <name>ВидНалога</name>
      <type>
        <types>CatalogRef.ВидыНалогов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Корреспонденция</name>
      <type>
        <types>ChartOfAccountsRef.Управленческий</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказПокупателя</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокУплаты</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодИФНС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодПоОКАТО</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидНалогаКор</name>
      <type>
        <types>CatalogRef.ВидыНалогов</types>
      </type>
    </attributes>
    <attributes>
      <name>КорреспонденцияРегл</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/src/Documents/НачислениеНалогов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Перем ИспользоватьТолькоРегламентированногоПланаСчетов Экспорт;
#Область ОбработчикиСобытий

// Процедура - обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Константы.ФункциональнаяОпцияУчетПоНесколькимПодразделениям.Получить() Тогда
		
		Для каждого СтрокаНалоги Из Налоги Цикл
			
			Если ИспользоватьТолькоРегламентированногоПланаСчетов Тогда
				Если СтрокаНалоги.КорреспонденцияРегл.ТипСчета = Перечисления.ТипыСчетов.НезавершенноеПроизводство
					ИЛИ СтрокаНалоги.КорреспонденцияРегл.ТипСчета = Перечисления.ТипыСчетов.КосвенныеЗатраты
					ИЛИ СтрокаНалоги.КорреспонденцияРегл.ТипСчета = Перечисления.ТипыСчетов.Доходы
					ИЛИ СтрокаНалоги.КорреспонденцияРегл.ТипСчета = Перечисления.ТипыСчетов.Расходы Тогда
					СтрокаНалоги.Подразделение = Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение;
				КонецЕсли;
			Иначе 
				Если СтрокаНалоги.Корреспонденция.ТипСчета = Перечисления.ТипыСчетов.НезавершенноеПроизводство
					ИЛИ СтрокаНалоги.Корреспонденция.ТипСчета = Перечисления.ТипыСчетов.КосвенныеЗатраты
					ИЛИ СтрокаНалоги.Корреспонденция.ТипСчета = Перечисления.ТипыСчетов.Доходы
					ИЛИ СтрокаНалоги.Корреспонденция.ТипСчета = Перечисления.ТипыСчетов.Расходы Тогда
					СтрокаНалоги.Подразделение = Справочники.СтруктурныеЕдиницы.ОсновноеПодразделение;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если НЕ Константы.ФункциональнаяОпцияУчетПоНесколькимНаправлениямДеятельности.Получить() Тогда
		
		Для каждого СтрокаНалоги Из Налоги Цикл
			Если ИспользоватьТолькоРегламентированногоПланаСчетов Тогда
				Если СтрокаНалоги.КорреспонденцияРегл.ТипСчета = Перечисления.ТипыСчетов.Доходы
					ИЛИ СтрокаНалоги.КорреспонденцияРегл.ТипСчета = Перечисления.ТипыСчетов.Расходы Тогда
					СтрокаНалоги.НаправлениеДеятельности = Справочники.НаправленияДеятельности.ОсновноеНаправление;
				КонецЕсли;
			Иначе
				Если СтрокаНалоги.Корреспонденция.ТипСчета = Перечисления.ТипыСчетов.Доходы
					ИЛИ СтрокаНалоги.Корреспонденция.ТипСчета = Перечисления.ТипыСчетов.Расходы Тогда
					СтрокаНалоги.НаправлениеДеятельности = Справочники.НаправленияДеятельности.ОсновноеНаправление;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
			
	КонецЕсли;
	
	СуммаДокумента = Налоги.Итог("Сумма");
	
КонецПроцедуры // ПередЗаписью()

// Процедура - обработчик события ОбработкаПроверкиЗаполнения объекта.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ИспользоватьТолькоРегламентированногоПланаСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(Дата);
	
	Если ВидОперации = Перечисления.ВидыОперацийНачислениеНалогов.Взаиморасчет Тогда
		ПроверяемыеРеквизиты.Добавить("Налоги.ВидНалогаКор");
	Иначе
		Если ИспользоватьТолькоРегламентированногоПланаСчетов Тогда
			ПроверяемыеРеквизиты.Добавить("Налоги.КорреспонденцияРегл");
		Иначе
			ПроверяемыеРеквизиты.Добавить("Налоги.Корреспонденция");
		КонецЕсли;
	КонецЕсли;
	
	Для каждого СтрокаНалоги Из Налоги Цикл
		
		Если НЕ ИспользоватьТолькоРегламентированногоПланаСчетов Тогда
			
			Если Константы.ФункциональнаяОпцияУчетПоНесколькимПодразделениям.Получить()
				И Не ВидОперации = Перечисления.ВидыОперацийНачислениеНалогов.Взаиморасчет
				И (СтрокаНалоги.Корреспонденция.ТипСчета = Перечисления.ТипыСчетов.НезавершенноеПроизводство
				ИЛИ СтрокаНалоги.Корреспонденция.ТипСчета = Перечисления.ТипыСчетов.КосвенныеЗатраты
				ИЛИ СтрокаНалоги.Корреспонденция.ТипСчета = Перечисления.ТипыСчетов.Доходы
				ИЛИ СтрокаНалоги.Корреспонденция.ТипСчета = Перечисления.ТипыСчетов.Расходы)
				И НЕ ЗначениеЗаполнено(СтрокаНалоги.Подразделение) Тогда
				ТекстСообщения = НСтр("ka='სია ""გადასახადების"" სტრიქონ  %НомерСтроки% მითითებული ანგარიშისთვის ""%Корреспонденция%"" უნდა შეივსოს რეკვიზიტი ""ქვეგანყოფილება"".';ru='Для счета затрат ""%Корреспонденция%"" указанного в строке %НомерСтроки% списка ""Налоги"", должен быть заполнен реквизит ""Подразделение"".';en='For costs account ""% Correspondence%"" of the line%% NomerStroki list of ""Taxes"" should be filled with props ""Division"".'"
				);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Корреспонденция%", СокрЛП(Строка(СтрокаНалоги.Корреспонденция))); 
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСтроки%",Строка(СтрокаНалоги.НомерСтроки));
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
				ЭтотОбъект,
				ТекстСообщения,
				"Налоги",
				СтрокаНалоги.НомерСтроки,
				"Подразделение",
				Отказ
				);
			КонецЕсли;
			
		Иначе	
			
			Если Константы.ФункциональнаяОпцияУчетПоНесколькимПодразделениям.Получить()
				И Не ВидОперации = Перечисления.ВидыОперацийНачислениеНалогов.Взаиморасчет
				И (СтрокаНалоги.КорреспонденцияРегл.ТипСчета = Перечисления.ТипыСчетов.НезавершенноеПроизводство
				ИЛИ СтрокаНалоги.КорреспонденцияРегл.ТипСчета = Перечисления.ТипыСчетов.КосвенныеЗатраты
				ИЛИ СтрокаНалоги.КорреспонденцияРегл.ТипСчета = Перечисления.ТипыСчетов.Доходы
				ИЛИ СтрокаНалоги.КорреспонденцияРегл.ТипСчета = Перечисления.ТипыСчетов.Расходы)
				И НЕ ЗначениеЗаполнено(СтрокаНалоги.Подразделение) Тогда
				ТекстСообщения = НСтр("ka='სია ""გადასახადების"" სტრიქონ  %НомерСтроки% მითითებული ანგარიშისთვის ""%Корреспонденция%"" უნდა შეივსოს რეკვიზიტი ""ქვეგანყოფილება"".';ru='Для счета затрат ""%Корреспонденция%"" указанного в строке %НомерСтроки% списка ""Налоги"", должен быть заполнен реквизит ""Подразделение"".';en='For costs account ""% Correspondence%"" of the line%% NomerStroki list of ""Taxes"" should be filled with props ""Division"".'"
				);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Корреспонденция%", СокрЛП(Строка(СтрокаНалоги.КорреспонденцияРегл))); 
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСтроки%",Строка(СтрокаНалоги.НомерСтроки));
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
				ЭтотОбъект,
				ТекстСообщения,
				"Налоги",
				СтрокаНалоги.НомерСтроки,
				"Подразделение",
				Отказ
				);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаПроведения. Формирует движения
// документа по регистрам накопления и бухгалтерскому регистру.
//
// 1. Удаление существующих движений документа.
// 2. Формирование структуры шапки документа с полями, используемыми алгоритмах
// проведения документа.
// 3. Проверка заполнения значений шапки и табличных частей документа.
// 4. Формирование временной таблицы по документу, необходимой для формирования
// движений.
// 5. Формирование движений документа по регистрам накопления.
// 6. Формирование движений документа по регистру бухгалтерии.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.НачислениеНалогов.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета.
	УправлениеНебольшойФирмойСервер.ОтразитьРасчетыПоНалогам(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходы(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьЗапасы(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьУправленческий(ДополнительныеСвойства, Движения, Отказ);
	// Щербаков +++
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтразитьХозрасчетный(ДополнительныеСвойства, Движения, Отказ);
	// Щербаков ---
	
	// Запись наборов записей.
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры // ОбработкаПроведения()

// Процедура - обработчик события ОбработкаУдаленияПроведения объекта.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для удаления проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

#КонецОбласти
ИспользоватьТолькоРегламентированногоПланаСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(?(ЗначениеЗаполнено(Дата),Дата,ТекущаяДата())); //+++ Дмгг
#КонецЕсли
